apache/nuttx/arch/arm/src/kinetis/kinetis_spi.c
  if (priv->nbits > 8)
    {
      /* 16-bit mode */

      while (nwords-- > 0)
        {
          /* Get the next word to write.  Is there a source buffer? */

          if (wtxptr)
            {
              word = *wtxptr++;
            }
          else
            {
              word = 0xffff;
            }

          /* Exchange one word */

          word = spi_send_data(priv, word, nwords ? false : true);

          /* Is there a buffer to receive the return value? */

          if (wrxptr)
            {
              *wrxptr++ = word;
            }
        }
    }
  else
    {
      /* 8-bit mode */

      while (nwords-- > 0)
        {
          /* Get the next word to write.  Is there a source buffer? */

          if (btxptr)
            {
              byte = *btxptr++;
            }
          else
            {
              byte = 0xff;
            }

          /* Exchange one word */

          byte = (uint8_t) spi_send_data(priv, (uint16_t)byte,
                                         nwords ? false : true);

          /* Is there a buffer to receive the return value? */

          if (brxptr)
            {
              *brxptr++ = byte;
            }
        }
    }
}

/****************************************************************************
 * Name: spi_exchange (with DMA capability)
 *
 * Description:
 *   Exchange a block of data on SPI using DMA
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to a buffer in which to receive data
 *   nwords   - the length of data to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits > 8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_SPI_DMA
static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                         void *rxbuffer, size_t nwords)
{
  int                      ret;
  size_t                   adjust;
  ssize_t                  nbytes;
  static uint8_t           rxdummy[4] aligned_data(4);
  static const uint16_t    txdummy = 0xffff;
  struct kinetis_spidev_s *priv    = (struct kinetis_spidev_s *)dev;

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv && priv->spibase);
  spiinfo("txbuffer=%p rxbuffer=%p nwords=%d\n", txbuffer, rxbuffer, nwords);

  /* Convert the number of word to a number of bytes */

  nbytes = (priv->nbits > 8) ? nwords << 1 : nwords;

  /* Invalid DMA channels fall back to non-DMA method. */

  if (priv->rxdma == NULL || priv->txdma == NULL
#ifdef CONFIG_KINETIS_SPI_DMATHRESHOLD
      /* If this is a small SPI transfer, then let spi_exchange_nodma()
       * do the work.
       */

      || nbytes <= CONFIG_KINETIS_SPI_DMATHRESHOLD
#endif
      )
    {
      spi_exchange_nodma(dev, txbuffer, rxbuffer, nwords);
      return;
    }

  /* Halt the SPI */

  spi_run(priv, false);

  /* Flush FIFOs */

  spi_modifyreg(priv, KINETIS_SPI_MCR_OFFSET,
                SPI_MCR_CLR_RXF | SPI_MCR_CLR_TXF,
                SPI_MCR_CLR_RXF | SPI_MCR_CLR_TXF);

  /* Clear all status bits */

  spi_write_status(priv, SPI_SR_CLEAR);

  /* disable DMA */

  spi_modifyreg(priv, KINETIS_SPI_RSER_OFFSET,
                SPI_RSER_RFDF_RE | SPI_RSER_TFFF_RE |
                SPI_RSER_RFDF_DIRS | SPI_RSER_TFFF_DIRS,
                0);

  /* Set up the DMA */

  adjust = (priv->nbits > 8) ? 2 : 1;

  struct kinetis_edma_xfrconfig_s config;

  config.saddr  = priv->spibase + KINETIS_SPI_POPR_OFFSET;
  config.daddr  = (uint32_t) (rxbuffer ? rxbuffer : rxdummy);
  config.soff   = 0;
  config.doff   = rxbuffer ? adjust : 0;
  config.iter   = nbytes;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = adjust == 1 ? EDMA_8BIT : EDMA_16BIT;
  config.dsize  = adjust == 1 ? EDMA_8BIT : EDMA_16BIT;
  config.nbytes = adjust;
#ifdef CONFIG_KINETIS_EDMA_ELINK
  config.linkch = NULL;
#endif
  kinetis_dmach_xfrsetup(priv->rxdma, &config);

  up_invalidate_dcache((uintptr_t)config.daddr,
                       (uintptr_t)config.daddr +
                       config.iter * config.nbytes);

  config.saddr  = (uint32_t) (txbuffer ? txbuffer : &txdummy);
  config.daddr  = priv->spibase + KINETIS_SPI_PUSHR_OFFSET;
  config.soff   = txbuffer ? adjust : 0;
  config.doff   = 0;
  config.iter   = nbytes;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = adjust == 1 ? EDMA_8BIT : EDMA_16BIT;
  config.dsize  = adjust == 1 ? EDMA_8BIT : EDMA_16BIT;
  config.nbytes = adjust;
#ifdef CONFIG_KINETIS_EDMA_ELINK
  config.linkch = NULL;
#endif

  up_clean_dcache((uintptr_t)config.saddr,
                  (uintptr_t)config.saddr + nbytes * adjust);

  kinetis_dmach_xfrsetup(priv->txdma, &config);

  spi_modifyreg(priv, KINETIS_SPI_RSER_OFFSET, 0 ,
                SPI_RSER_RFDF_RE | SPI_RSER_TFFF_RE |
                SPI_RSER_RFDF_DIRS | SPI_RSER_TFFF_DIRS);

  /* Start the DMAs */

  spi_dmarxstart(priv);
  spi_run(priv, true);

  spi_putreg(priv, KINETIS_SPI_TCR_OFFSET, 0);
  spi_write_control(priv, SPI_PUSHR_CTAS_CTAR0);

  spi_dmatxstart(priv);

  /* Then wait for each to complete */

  ret = spi_dmarxwait(priv);

  if (ret < 0)
    {
      ret = spi_dmatxwait(priv);
    }

  /* Reset any status */

  spi_write_status(priv, spi_getreg(priv, KINETIS_SPI_SR_OFFSET));

  /* Halt SPI */

  spi_run(priv, false);

  /* Disable DMA */

  spi_modifyreg(priv, KINETIS_SPI_RSER_OFFSET,
                SPI_RSER_RFDF_RE | SPI_RSER_TFFF_RE |
                SPI_RSER_RFDF_DIRS | SPI_RSER_TFFF_DIRS,
                0);
}

#endif /* CONFIG_KINETIS_SPI_DMA */
/****************************************************************************
 * Name: spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - the length of data to send from the buffer in number of
 *              words. The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.  If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(struct spi_dev_s *dev,
                         const void *txbuffer,
                         size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%d\n", txbuffer, nwords);
  return spi_exchange(dev, txbuffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that can be received in the buffer in
 *              number of words.  The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.  If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                          size_t nwords)
{
  spiinfo("rxbuffer=%p nwords=%d\n", rxbuffer, nwords);
  return spi_exchange(dev, NULL, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: spi_dmarxwait
 *
 * Description:
 *   Wait for DMA to complete.
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_SPI_DMA
static int spi_dmarxwait(struct kinetis_spidev_s *priv)
{
  int ret;

